//
//  UIKeywordController.h
//  MSC20Demo
//
//  Created by msp on 12-9-12.
//  Copyright 2012 IFLYTEK. All rights reserved.
//

#import <UIKit/UIKit.h>
#import "UIDemoBaseController.h"
#import "iFlyISR/IFlyRecognizeControl.h"
#import "UIKeywordSetupController.h"


#define H_KEYWORD_FRAME CGRectMake(20, 260, 280, 40)

#define H_KEYWORD_TIP_FRAME CGRectMake(100, 240, 160, 60)

// 按键坐标
#define H_BUTTON_UPLOAD CGRectMake(20, 360, 80, 40)
#define H_BUTTON_KEYWORD CGRectMake(120, 360, 80, 40)
#define H_BUTTON_SETUP CGRectMake(220, 360, 80, 40)

#define KEYWORD_STRING @"阿里山龙胆,浦发银行,邯郸钢铁,齐鲁石化,东北高速,武钢股份,东风汽车,中国国贸,首创股份,上海机场,钢联股份,民生银行,上港集箱,宝钢股份,福建高速,歌华有线,哈飞股份,宁波联合,浙江广厦,江西纸业,黄山旅游,万东医疗,中技贸易,厦新电子,龙腾科技,古越龙山,海信电器,中纺投,双鹤药业,皖维高新,南京高科,大庆联谊,宇通客车,福州大通,葛洲坝,银鸽投资,浙江富润,凤凰光学,江南重工,上海梅林,南京中达,新疆天业,青鸟华光,国能集团,澄星股份,人福科技,金花股份,东风科技,津百股份,红光,新天国际,同仁堂,多佳股份,南京水运,中视股份,特变电工,啤酒花,明天科技,精密股份,禾嘉股份,华源股份,哈高科,云天化,恒泰,广州控股,林海股份,清华同方,明星电力,莱钢股份,青山纸业,上海汽车,永鼎光缆,重庆路桥,美尔雅,亚盛集团,成百,长春热缩,稀土高科,长征电器,浙江东日,东方航空,三峡水利,西宁特钢,中国泛旅,长江投资,浙江东方,郑州煤电,宏图高科,兰花科创,铁龙股份,杭钢股份,金健米业,江苏工艺,太极集团,波导股份,岷江水电,重庆啤酒,东湖高新,乐凯胶片,道博股份,长江包装,青旅控股,鼎天科技,兴发集团,四维瓷业,大元股份,离合器,邢台轧辊,重机,航天机电,维科精华,厦门建发,宝硕股份,益鑫泰,鲁润股份,中体产业,宁城老窖,巨化股份,天坛生物,山东临工,福建南纸,宁夏恒力,福田股份,黎明股份,武汉控股,太原重工,上海建工,上海贝岭,黄河旋风,牡丹江,宝华实业,中国化建,雅戈尔,东安动力,黑化股份,九发股份,云大科技,桦林轮胎,生益科技,海星科技,莲花味精,黑龙股份,兖州煤业,吉林森工,锦州港,华资实业,长城电工,创兴科技,中牧股份,复星实业,伊力特,大唐电信,金牛实业,江苏吴中,金宇集团,哈空调,福日股份,山东铝业,有研硅股,安彩高科,戴梦得,罗顿发,紫江企,西藏药业,江泉实业,亚星客车,长春经开,浙江医药,秦岭水泥,全柴动力,南山实业,江苏阳光,海南航空,众生制药,万杰高科,天香集团,升华拜克,赤天化,昌九股份,青岛碱业,沧州大化,凌钢股份,金鹰股份,大连创世,天龙集团,民丰特纸,桂冠电力,铜峰电子,海南椰岛,红河光明,仕奇实业,辽宁时代,华龙集团,青海华鼎,先锋股份,物华股份,秦丰农业,南纺股份,中恒集团,天方药业,鑫科材料,广汇股份,洞庭水殖,首旅股份,兴业聚酯,凯乐股份,浙江阳光,北方股份,路桥建设,景谷林业,北京城建,海正药业,国电南自,赣粤高速,外运发展,开开实业,武昌鱼,亿利科技,东方创业,重庆港九,太化股份,南钢股份,钱江水利,羚锐股份,国光瓷业,江苏舜天,大恒科技,亿阳信通,苏福马,西水股份,九龙电力,兰州铝业,美罗药业,安琪酵母,星新材料,维维股份,南化股份,标准股份,曙光股份,恒顺醋业,商业城,酒钢宏兴,华泰股份,烟台万华,桂东电力,平高电气,中农资源,上海家化,洪都航空,巢东股份,亚星化学,振华港机,南海发展,西藏天路,兰太实业,天通股份,广州药业,长春燃气,中发展,澳柯玛,美克股份,珠峰摩托,天利高新,长江通信,恒丰纸业,国旅联合,新农开发,华微电子,联创光电,通葡萄酒,宁波韵升,红星发展,五洲交通,长运股份,天鸿宝业,宁沪高速,天科股份,广东明珠,金地集团,北京巴士,龙净环保,江山股份,金瑞科技,凯诺科技,抚顺特钢,红豆股份,昆明制药,中化国际,康美药业,天威保变,青岛啤酒,方正科技,真空电子,兴业房产,二纺机,轻工机械,金丰投资,上实联合,上海科技,一汽金杯,中纺机,大众交通,第一铅笔,永生股份,胶带股份,丰华圆珠,第一食品,联华合纤,氯碱化工,冰箱压缩,天宸股份,上海金陵,嘉宝实业,轮胎橡胶,复华实业,水仙,申达股份,电器股份,新世界,棱光,龙头股份,第一百货,华联商厦,双鹿,海鸟电子,大众科创,三爱富,广电股份,新黄浦,浦东金桥,联通国脉,中远发展,申能股份,爱建股份,乐山电力,望春花,国嘉实业,粤海发,外高桥,原水股份,新锦江,飞乐音响,爱使股份,华晨集团,飞乐股份,豫园商城,华源制药,青鸟天桥,兆维科技,福建福联,福耀玻璃,交大南洋,上海强生,陆家嘴,哈药集团,沪昌特钢,西南药业,太极实业,尖峰集团,鞍山合成,高斯达,天目药业,英豪科教,成量股份,川投控股,中华企业,交运股份,浙江中汇,四川金顶,凤凰股份,上海邮通,诚成文化,南京新百,甬华联,珠江实业,广船国际,厦门汽车,新宇软件,上海石化,上海三毛,青岛海尔,东新电碳,亚通股份,东百集团,大商股份,大江股份,福建豪盛,欧亚集团,济南轻骑,辽源得亨,数玛测绘,工大高新,沱牌曲酒,天颐,中大股份,北亚集团,长安信息,彩虹股份,东海股份,蓝田股份,常林股份,雄震集团,南宁百货,南京医药,山川股份,松辽汽车,耀华玻璃,天津港,东大阿派,大连热电,祁连山,百花村,沧州化工,西单商场,宁波富达,云维股份,龙电股份,鲁北化工,新太科技,重庆百货,中国高科,湖南海利,上海港机,前锋股份,实达电脑,兰陵陈香,苏州高新,新疆屯河,兰州民百,辽宁成大,山西焦化,巴士股份,一汽四环,华银电力,康赛集团,江苏索普,大显股份,浦东不锈,西藏圣地,东风药业,天津海运,哈慈股份,冰熊股份,新亚股份,厦门国贸,齐鲁软件,华源发展,金帝建设,琼华侨,山东黑豹,安徽合力,金荔科技,北京中燕,三星石化,力源液压,烟台发展,运盛实业,宁波华通,祥龙电业,综艺股份,东盛科技,石油龙昌,西藏金珠,汉商集团,南京熊猫,东方通信,新潮实业,友好集团,全兴股份,通宝能源,民丰实业,新华股份,四砂股份,鲁银投资,新华百,东方锅炉,中储股份,达尔曼,鲁抗医药,轻纺城,贵华旅业,云南马龙,宜宾纸业,保税科技,国电电力,钱江生化,天然科技,宁波海运,科利华,天津磁卡,华新水泥,福建水泥,威远生化,工益股份,悦达投资,昆机机床,济南百货,马钢股份,山西汾酒,神马实业,东方集团,华北制药,鞍一工,杭州解百,厦工股份,鞍山信托,宏盛科技,永久,耀皮玻璃,隧道股份,津劝业,物贸中心,万象集团,益民百货,华联超市,兰生股份,友谊股份,成商集团,天鹅股份,甬城隍庙,黄河科,东方明珠,网点,凌桥股份,上菱电器,界龙实业,农商社,上海九百,四川长虹,浙江创业,上柴股份,中西药业,上工股份,英雄股份,钢管,同济科技,万里电池,自仪股份,上海医药,华东电脑,海欣股份,中川国际,北特钢,春兰股份,北旅,长百集团,首创科技,渤海集团,王府井,北人股份,北京城乡,纵横国际,内蒙华电,岁宝热电,百大集团,星湖科技,通化东宝,梅雁股份,青海三普,厦华电子,仪征化纤,中炬高新,西藏明珠,创业环保,东方电机,洛阳玻璃,中国嘉陵,北大科技,火箭股份,博瑞传播,亚泰集团,山东农药,富邦科技,杉杉股份,双虎涂料,湖北兴化,伊利股份,新疆众和,南京化纤,长春长铃,秋林集团,石劝业,吉发股份,广钢股份,张江高科,中海海盛,厦门机场,郑百文,信联股份,深发展,深万科,金田,深安达,世纪星源,深振业,深达声,亿安科技,深宝安,深华新,深物业,深南玻,深石化,深华源,中浩,深康佳,中华,深中冠,深深宝,深华发,深科技,深赤湾,深天地,招商局,特力,飞亚达,深能源,深益力,深深房,英达,深宝恒,深桑达,新都酒店,深信泰丰,中科健,华联控股,深南电,深大通,中集集团,深鸿基,深长城,深南光,深纺织,光彩建设,中侨,中科创业,深万山,深天马,深圳方大,深国商,深赛格,辽通化工,中金岭南,农产品,深圳华强,中兴通讯,北方国际,长城电脑,赛格三星,华侨城,特发信息,海王生物,盐田港,深圳机场,深天健,广聚能源,中信海直,麦科特,中成股份,新力药业,川化股份,安塑股份,中联重科,常山股份,国际实业,丝绸股份,许继电器,冀东水泥,金融街,三九生化,华意压缩,有色鑫光,石油大明,胜利股份,河北华玉,四通高科,沈阳机床,凯地,北方五环,宝石,汇通水利,青岛国货,合肥百货,小天鹅,通程控股,吉林化纤,南京中北,湖北宜化,东阿阿胶,徐工科技,富龙热力,华天酒店,粤高速,张家界,晨鸣纸业,丹东化纤,鄂武商,琼能源,海虹控股,赛迪传媒,珠江控股,东泰控股,粤富华,琼民源,天歌科技,金路集团,银基发展,丽珠集团,渝开发,渝钛白,陕解放,甬成功,四环生物,银河动力,中国凤凰,美菱电器,白云山,广州浪奇,东方宾馆,红太阳,厦海发,粤美的,桂柳工,粤美雅,大冷股份,穗恒运,粤华电,万家乐,汕电力,猴王,闽闽东,南开戈德,云南白药,粤电力,世纪中天,佛山照明,皖能电力,豫白鸽,恒和制药,吉轻工,闽福发,湖南投资,湘火炬,江铃汽车,创元科技,甘长风,沙隆达,泰山石油,太光电信,南洋,银广夏,辽房天,万向钱潮,昆百大,陕长岭,宏源证券,陕国投,西安民生,渝三峡,轻骑海药,琼海德,泸州老窖,川投长钢,苏常柴,新大洲,琼金盘,粤宏远,广东甘化,数码网络,威孚高科,北海新力,托普软件,蜀都,东北电,川长江,光明家具,粤金曼,黔轮胎,紫光生飢桐君阁,中福,成都华联,内蒙宏峰,西北轴承,古井贡,东北药,蓝星清洗,青岛双星,国际大厦,韶能股份,金马,威达医械,中联建设,青海明胶,华立控股,阳光股份,燕化高新,西安旅游,民族集团,焦作万方,东海,湖北金环,大连渤海,石油济柴,吉林化工,海螺型材,圣方科技,比特科技,岳阳恒立,吉林敖东,长安汽车,如意集团,百科药业,倍特高新,新钢钒,铜都铜业,兰宝信息,三木集团,合金投资,民族化工,风华高科,茂化实华,中辽国际,庆云发展,九江化纤,格力电器,泰达股份,九州,华光陶瓷,重庆东源,中钨高新,海洋,珠海中富,南华西,长春高新,康达,永安林业,武汉塑料,经纬纺机,华一投资,武汉石油,中讯科技,天发股份,石狮新发,铜城集团,大同水泥,银山,思达高科,山东海龙,襄阳轴承,大连友谊,山推股份,远东股份,东方电子,天然碱,公用科技,锦州六陆,保定天鹅,朝华科技,宏业,宝丽华,寰岛实业,惠天热电,聚友网络,灯塔油漆,联益,咸阳偏转,沈阳化工,佳纸股份,模塑科技,厦门信达,正虹饲料,招商股份,浙江震元,双环科技,大冶特钢,唐钢股份,天兴仪表,龙发股份,金泰发展,丰乐种业,中兴商业,广西斯壮,韶钢松山,吉林纸业,焦作碱业,鲁能泰山,西安饮食,金果实业,天宇电气,华东科技,北京化二,燕京啤酒,环保股份,四川美丰,福建三农,振华科技,罗牛山,重庆实业,南风化工,南方摩托,青岛东方,湘计算机,桂林集琦,锌业股份,拉萨啤酒,福建双菱,山西三维,新华制药,内江峨柴,中色建设,武汉中百,湖北车桥,本钢板材,西藏矿业,锦州石化,华信股份,通化金马,漳泽电力,西飞国际,盛道包装,延边公路,中核科技,新兴铸管,三毛派神,草原兴发,美达股份,石炼化,武汉中商,北新建材,创智科技,合成制药,江西水泥,华神集团,西北化工,盐湖钾肥,燃气股份,太原钢玉,宝商集团,中国武夷,中水渔业,湘酒鬼,一汽轿车,四川湖山,京西旅游,美亚股份,炎黄在线,银河科技,云铝股份,第一纺织,四川锦华,烟台冰轮,陕西金叶,天山纺织,美利纸业,江淮动力,辽河油田,锦化氯碱,岳阳兴长,金城股份,京山轻机,山东海化,超声电子,太钢不锈,国投原宜,大龙泉,福地科技,赣南果业,鲁西化工,关铝股份,龙涤股份,贵糖股份,隆源实业,天大天财,秦川发展,西化机,中信国安,承德露露,华茂股份,中国七砂,江钻股份,唐山陶瓷,五粮液,国风塑业,顺鑫农业,茂化永业,吴忠仪表,北商技术,扬子石化,安凯客车,张裕,新希望,天山股份,云南铜业,山东巨力,大连国际,中商股份,三环股份,春都,海南高速,飞彩股份,峨眉山,华联商城,法尔胜,长丰通信,广州冷机,双汇发展,豫能控股,津滨发展,鞍钢新轧,赣能股份,现代投资,航天科技,中国服装,云内动力,厦门路桥,南方建材,天一科技,数源科技,大亚股份,南宁糖业,泸天化,钱江摩托,声乐股份,华北高速,电广传媒,亚华种业,金陵药业,南方汇通,科龙电器,阿继电器,河北宣工,浙大海纳,福星科技,天津汽车,吉林炭素,兰州黄河,丰原生化,中关村,华菱管线,神火股份,四川双马,华西村,金牛能源,清华紫光,凯迪电力,南天信息,新乡化纤,民丰农化,小鸭电器,广济药业,河池化工,欣龙无纺,中原油气,中通控股,东方热电,首钢股份,锡业股份,大连金牛,东方钽业,华东医药,天水股份,长源电力,上风高科,神州股份,安泰科技,中科三环,湖北迈亚,佛塑股份,乌江电力,春晖股份,浪潮信息,桂林旅游,科苑集团,金马股份,兰光科技,圣雪绒,西山煤电,大庆华科,广州友谊,华工科技,九芝堂,诚志股份,闽东电力,皇台酒业,捷利股份,新大陆,隆平高科,三九医药,基金景宏,基金景博,基金景福,基金兴科,基金兴安,基金景阳,基金兴华,基金兴和,科大讯飞"

#define KEYWORD_ID @"\\\\192.168.72.37\\usr_gr/masr_007db_041508-03-25_11-59-48-271.abnf"

#define KEYWORD_UPLOAD @"武汉控股,福田股份,黎明股份,歌华有线,太原重工,上海建工,牡丹江,天宸股份,基金兴华,基金兴和,科大讯飞"

@interface UIKeywordController : UIDemoBaseController <IFlyRecognizeControlDelegate,UITableViewDelegate>
{
	// UI
	UIButton					*_uploadButton;
	UIButton					*_keywordButton;
	UIButton					*_setupButton;
	UITextView					*_textTip;
	IFlyRecognizeControl		*_iFlyRecognizeControl;
	UIKeywordSetupController	*_keywordSetupController;
	NSString					*_keywordID;
	
	// 中间变量
	IsrType _type;
}

@end
